NamJeongkuk/ref_main/src/micro-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_widgets.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2015 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : r_widgets.c
* Description  : This file contains support functions for key, slider, and wheel initializations and calculations.
***********************************************************************************************************************/

/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              :            0.85    Shinji Takeda: Add "return status" to else condition, line 447 in touch_calibration()
*              : 04.10.2018 1.00    First Release
*              : 29.04.2019 1.10    Removed former offset tuning functions and related variable initializations.
*              :                    Fixed slider_decode_abnormal_judgement() bug hardcoded for 4 sensors (Takeda-san).
*              :                    Added #pragma sections and modified for GCC/IAR compatibility.
***********************************************************************************************************************/

/***********************************************************************************************************************
* Includes
***********************************************************************************************************************/
#include "r_touch_qe_private.h"
#include "r_touch_qe_if.h"
#include "qe_common.h"


/***********************************************************************************************************************
* Macro definitions
***********************************************************************************************************************/
#define WIDGETS_PRV_OFF     (0)
#define WIDGETS_PRV_ON      (1)

#define WIDGETS_PRV_KEY_GROUP0      (16)
#define WIDGETS_PRV_KEY_GROUP1      (32)
#define WIDGETS_PRV_KEY_GROUP2      (48)
#define WIDGETS_PRV_KEY_GROUP3      (64)


/***********************************************************************************************************************
* Typedef definitions
***********************************************************************************************************************/


/***********************************************************************************************************************
* Global variables and functions
***********************************************************************************************************************/
static void     touch_sensor_index_set(uint8_t method, ctsu_cfg_t *p_ctsu_cfgs[]);
static uint8_t  touch_drift_correction(uint8_t method, uint16_t value, uint8_t group, uint8_t offset);
static void     touch_judgement_parameter_create(uint8_t method, uint16_t value);
static void     touch_judgement(uint8_t method, uint16_t key_val_sub, uint8_t group, uint8_t offset);


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_parameter_set
* Description  : Touch parameter setting
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
void touch_parameter_set(ctsu_cfg_t *p_ctsu_cfgs[], touch_cfg_t *p_touch_cfgs[])
{
    uint8_t     method;
    uint8_t     pt;
#if ((QE_MAX_SLIDERS != 0) || (QE_MAX_WHEELS != 0))
    uint8_t     id;
#endif



    for (method = 0; method < g_open_num_methods; method++)
    {
        /**************************************************************************************************************/
        /*****     Touch function parameter setting     ***************************************************************/
        /**************************************************************************************************************/
        /* Compulsion touch cancellation frequency setting    */
        g_touch_paramter[method].msa_freq          = p_touch_cfgs[method]->max_on_time;

        /* Continuous agreement touch comparison frequency setting    */
        g_touch_paramter[method].touch_freq        = p_touch_cfgs[method]->touch_on;

        /* Continuous agreement non-touch comparison frequency setting    */
        g_touch_paramter[method].not_touch_freq    = p_touch_cfgs[method]->touch_off;

        /* Drift correction frequency setting    */
        g_touch_paramter[method].drift_freq        = p_touch_cfgs[method]->drift_freq;

        /**************************************************************************************************************/
        /*****     Touch function flag setting          ***************************************************************/
        /**************************************************************************************************************/
        g_touch_function[method].value             = 0x00;  /* Touch function flag initial                     */

        if (g_touch_paramter[method].msa_freq)
        {
            g_touch_function[method].flag.msa      = WIDGETS_PRV_ON;    /* Compulsion touch cancellation function enable   */
        }

