NamJeongkuk/ref_main/src/micro-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_widgets.c
        if (g_touch_paramter[method].touch_freq)
        {
            g_touch_function[method].flag.acd0     = WIDGETS_PRV_ON;    /* Continuous touch comparison function enable     */
        }

        if (g_touch_paramter[method].not_touch_freq)
        {
            g_touch_function[method].flag.acd1     = WIDGETS_PRV_ON;    /* Continuous non-touch comparison function enable */
        }

        if (1 == p_touch_cfgs[method]->drift_enable)
        {
            g_touch_function[method].flag.drift    = WIDGETS_PRV_ON;    /* Drift correction function enable                */
        }
        else
        {
            g_touch_function[method].flag.drift    = WIDGETS_PRV_OFF;
        }


        /**************************************************************************************************************/
        /*****     Threshold and Hysteresis setting     ***************************************************************/
        /**************************************************************************************************************/
#if (QE_MAX_BUTTONS != 0)
        for (pt = 0; pt < g_key_info[method].key_num; pt++)
        {
             *(g_key_info[method].user_thr + pt)   = p_touch_cfgs[method]->p_buttons[pt].thr_offset;
             *(g_key_info[method].hys      + pt)   = p_touch_cfgs[method]->p_buttons[pt].hys_offset;
        }

        /**************************************************************************************************************/
        /*****     Touch parameter initial setting     ****************************************************************/
        /**************************************************************************************************************/
        for (pt = 0; pt < g_key_info[method].key_max_group; pt++)
        {
             *(g_key_info[method].in_touch         + pt) = 0x0000;
             *(g_key_info[method].out_touch        + pt) = 0x0000;
             *(g_key_info[method].touch_result     + pt) = 0x0000;
             *(g_key_info[method].drift_permission + pt) = 0xFFFF;
             *(g_key_info[method].key_used_info    + pt) = p_touch_cfgs[method]->button_masks[pt];
        }


#endif /* (QE_MAX_BUTTONS != 0) */

        /* for every element */
        for (pt = 0; pt < g_key_info[method].ena_num; pt++)
        {
             *(g_touch_tuning_info[method].result  + pt) = 0;
             g_touch_tuning_info[method].ctsuso[pt] = 0;        // no offset tuning direction set
             g_current_sign_pt[method][pt] = -1;                // tuning direction change count
        }

        /* Self mode button masks (1 << sensor number) */
        g_touch_all_result[method].button[0] = 0x0000;
        g_touch_all_result[method].button[1] = 0x0000;
        g_touch_all_result[method].button[2] = 0x0000;

        /* Mutual mode button masks (1 << element index) */
        g_touch_all_result[method].matrix[0] = 0x0000;
        g_touch_all_result[method].matrix[1] = 0x0000;
        g_touch_all_result[method].matrix[2] = 0x0000;
        g_touch_all_result[method].matrix[3] = 0x0000;

#if (QE_MAX_SLIDERS != 0)
        for (id = 0; id < QE_MAX_SLIDERS; id++)
        {
            g_touch_all_result[method].slider[id] = 0xFFFF;
        }
#endif

#if (QE_MAX_WHEELS != 0)
        for (id = 0; id < QE_MAX_WHEELS; id++)
        {
            g_touch_all_result[method].wheel[id] = 0xFFFF;
        }
#endif

        /**************************************************************************************************************/
        /****    Initialize index table for conversion ts-number to SENSOR0_NUM index    ******************************/
        /**************************************************************************************************************/
        touch_sensor_index_set(method, p_ctsu_cfgs);

   }

}    /* End of function touch_parameter_set() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_sensor_index_set
* Description  : 
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
static void touch_sensor_index_set(uint8_t method, ctsu_cfg_t *p_ctsu_cfgs[])
{
    uint16_t    chac_stor;
    uint8_t     loop;
    uint8_t     pt;
    uint8_t     cmp_key[3];
    uint8_t     key_num;
    uint8_t     used_key;


    chac_stor = p_ctsu_cfgs[method]->ctsuchac0 | (p_ctsu_cfgs[method]->ctsuchac1 << 8);

    if (TOUCH_SELF_MODE == g_key_info[method].mode )
    {
        used_key = 0;
        pt = 0;

        if (32 < MCU_MAX_SENSORS)
        {
#if (MCU_MAX_SENSORS > 32)
            cmp_key[0] = 16;
            cmp_key[1] = 16;
            cmp_key[2] = MCU_MAX_SENSORS - 32;
#endif
        }
        else if (16 < MCU_MAX_SENSORS)
        {
#if (MCU_MAX_SENSORS > 16)
            cmp_key[0] = 16;
            cmp_key[1] = MCU_MAX_SENSORS - 16;
            cmp_key[2] = 0;
#endif
        }
        else
        {
            cmp_key[0] = MCU_MAX_SENSORS;
            cmp_key[1] = 0;
            cmp_key[2] = 0;
        }

        for (loop = 0; loop < 3; loop++)
        {
            for (key_num = 0; key_num < cmp_key[loop]; key_num++)
            {
                if (0 != (chac_stor & (1 << key_num)))
                {
                     *(g_key_info[method].sensor_index + pt) = used_key++;
                }
                else
                {
                     *(g_key_info[method].sensor_index + pt) =  0xFF;
                }
                pt = pt + 1;
            }
            if(0 == loop)
            {
                chac_stor  = p_ctsu_cfgs[method]->ctsuchac2 | (p_ctsu_cfgs[method]->ctsuchac3 << 8);
            }
            else if (1 == loop)
            {
                chac_stor  = p_ctsu_cfgs[method]->ctsuchac4;
            }
            else
            {
                ;   // coding standard requirement
            }
        }
    }
    else
    {
        for (key_num = 0, used_key = 0; key_num < g_key_info[method].ena_num; key_num++)
        {
            if (16 > key_num)
            {
                if (0 != ((*g_key_info[method].key_used_info) & (0x0001 << key_num)))
                {
                     *(g_key_info[method].sensor_index + key_num) = used_key++;
                }
                else
                {
                     *(g_key_info[method].sensor_index + key_num) =  0xFF;
                }
            }
            else if (32 > key_num)
            {
                if (0 != ((*(g_key_info[method].key_used_info + 1)) & (0x0001 << (key_num - 16))))
                {
                     *(g_key_info[method].sensor_index + key_num) = used_key++;
                }
                else
                {
                     *(g_key_info[method].sensor_index + key_num) =  0xFF;
                }
            }
            else if (48 > key_num)
            {
                if (0 != ((*(g_key_info[method].key_used_info + 2)) & (0x0001 << (key_num - 32))))
                {
                     *(g_key_info[method].sensor_index + key_num) = used_key++;
                }
                else
                {
                     *(g_key_info[method].sensor_index + key_num) =  0xFF;
                }
            }
            else
            {
                if (0 != ((*(g_key_info[method].key_used_info + 3)) & (0x0001 << (key_num - 48))))
                {
                     *(g_key_info[method].sensor_index + key_num) = used_key++;
                }
                else
                {
                     *(g_key_info[method].sensor_index + key_num) =  0xFF;
                }
            }
        }
    }
}    /* End of function touch_sensor_index_set() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_key_decode
* Description  : Touch Key decoding
* Arguments    : uint8_t  method    : Measurement method(0-8)
*              : uint16_t value     : Sensor data
*              : uint8_t  number    : Key number
* Return Value : None
***********************************************************************************************************************/
void touch_key_decode( uint8_t method, uint16_t value, uint8_t number )
{
    uint8_t    key_id;
    uint8_t    offset;
    uint16_t   sbit;

    touch_judgement_parameter_create( method, value );          /* Make ON/OFFdecision-value */

    if (WIDGETS_PRV_KEY_GROUP0 > number)
    {
        key_id = 0;
        offset = number;
    }
    else if (WIDGETS_PRV_KEY_GROUP1 > number)
    {
        key_id = 1;
        offset = (number - WIDGETS_PRV_KEY_GROUP0);
    }
    else if (WIDGETS_PRV_KEY_GROUP2 > number)
    {
        key_id = 2;
        offset = (number - WIDGETS_PRV_KEY_GROUP1);
    }
    else if (WIDGETS_PRV_KEY_GROUP3 > number)
    {
        key_id = 3;
        offset = (number - WIDGETS_PRV_KEY_GROUP2);
    }
    else
    {
        return;
    }

    sbit = (0x0001 << offset);
    if (0x0000 == ((*(g_key_info[method].key_used_info + key_id)) & sbit))
    {
        return;
    }

    touch_judgement( method, value, key_id, offset );             /* ON/OFF judgment               */
    touch_drift_correction( method, value, key_id, offset);       /* Drift correction              */

    if ((g_key_info[method].key_num - 1) == g_data_tim)
    {
        g_data_tim = 0;
    }
    else
    {
        g_data_tim = (g_data_tim + 1);
    }
}    /* End of function touch_key_decode() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_judgement_parameter_create
* Description  : Touch/non-touch judgement parameter creatting function. Create parameters are g_dcount and g_cthr.
* Arguments    : value    Measurement value
* Return Value : None
***********************************************************************************************************************/
static void touch_judgement_parameter_create( uint8_t method, uint16_t value )
{
    uint16_t over_cnt;

    if (TOUCH_SELF_MODE == g_key_info[method].mode)
    {
        if ( (*(g_key_info[method].ref  + g_data_tim)) < value )
        {
            /* Dcount = g_nref - g_ncount */
             *(g_key_info[method].delta  + g_data_tim) = (uint16_t)(value  - (*(g_key_info[method].ref  + g_data_tim)));
        }
        else
        {
             *(g_key_info[method].delta  + g_data_tim) = 0;
        }

