NamJeongkuk/ref_main/src/micro-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_widgets.c
        over_cnt = (65535 - (*(g_key_info[method].user_thr + g_data_tim)));

        if (over_cnt > (*(g_key_info[method].ref  + g_data_tim)))
        {
             *(g_key_info[method].thr  + g_data_tim) = ((*(g_key_info[method].ref + g_data_tim)) + (*(g_key_info[method].user_thr + g_data_tim)));
        }
        else
        {
             *(g_key_info[method].thr  + g_data_tim) = 65535;
        }
    }
    else
    {
        if ((*(g_key_info[method].ref  + g_data_tim)) > value)
        {
            *(g_key_info[method].delta  + g_data_tim) = ((*(g_key_info[method].ref  + g_data_tim)) - value);
        }
        else
        {
             *(g_key_info[method].delta  + g_data_tim) = 0;
        }

        if ((*(g_key_info[method].ref  + g_data_tim)) > (*(g_key_info[method].thr  + g_data_tim)))
        {
             *(g_key_info[method].thr  + g_data_tim) = ((*(g_key_info[method].ref  + g_data_tim)) - (*(g_key_info[method].user_thr + g_data_tim)));
        }
        else
        {
             *(g_key_info[method].thr  + g_data_tim) = 0;
        }
    }
}    /* End of function touch_judgement_parameter_create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_judgement
* Description  : 
* Arguments    : value    Measurement value
*              : group    Key touch/non-touch data storage buffer ID
*              : offset   Key number offset value
* Return Value : None
***********************************************************************************************************************/
static void touch_judgement( uint8_t method, uint16_t value, uint8_t group, uint8_t offset )
{
    uint16_t    sbit;
    uint32_t    ntouch_val;
    uint16_t    freq;

    if (TOUCH_SELF_MODE == g_key_info[method].mode)
    {
        if ((*(g_key_info[method].thr + g_data_tim)) > (*(g_key_info[method].hys + g_data_tim)))
        {
            /* should always be positive number, but cast to uint16_t for safety */
            ntouch_val = (uint16_t)((*(g_key_info[method].thr + g_data_tim)) - (*(g_key_info[method].hys + g_data_tim)));
        }
        else
        {
            ntouch_val = *(g_key_info[method].thr + g_data_tim);
        }
    
        sbit = ( 0x0001 << offset );
        if (value > (*(g_key_info[method].thr  + g_data_tim)))              /* Measurement value > Threshold = Touch */
        {
             (*(g_key_info[method].in_touch + group)) |= sbit;              /* Inside touch */
        }
        else if (value < ntouch_val )                                       /* Measurement value < Threshold = Non-Touch */
        {
             (*(g_key_info[method].in_touch + group)) &= (~sbit);           /* Inside non-touch */
        }
        else
        {
            ;   /* Do Nothing */
        }
    }
    else                                                                    /* Mutual-capacitance measurement */
    {
        /* cast to 32-bit for calculations */
        ntouch_val = (uint32_t)(*(g_key_info[method].thr + g_data_tim)) + (uint32_t)(*(g_key_info[method].hys + g_data_tim));

        sbit = ( 0x0001 << offset );
        if (value < (*(g_key_info[method].thr + g_data_tim)))               /* Measurement value < Threshold = Touch */
        {
             (*(g_key_info[method].in_touch + group)) |= sbit;              /* Inside touch */
        }
        else if (value > ntouch_val)                                        /* Measurement value > Threshold = Non-Touch */
        {
             (*(g_key_info[method].in_touch + group)) &= (~sbit);           /* Inside non-touch */
        }
        else
        {
            ;   /* Do Nothing */
        }
    }

    if (0 != ((*(g_key_info[method].in_touch + group)) & sbit))             /* Inside touch flag check */
    {
         *(g_key_info[method].non_touch_cnt  + g_data_tim) = 0;             /* Inside non-touch counter clear */

        if (WIDGETS_PRV_OFF == g_touch_function[method].flag.acd0 )         /* Total touch function enable flag check */
        {
            freq = 1;
        }
        else
        {
            freq = g_touch_paramter[method].touch_freq;
        }

        if (freq == (*(g_key_info[method].touch_cnt  + g_data_tim)))        /* Outside touch */
        {
            *(g_key_info[method].out_touch  + group) = ((*(g_key_info[method].out_touch + group)) | sbit);    /* Outside touch */
            if (0 != g_touch_paramter[method].msa_freq)
            {
                *(g_key_info[method].touch_cnt  + g_data_tim) = (*(g_key_info[method].touch_cnt  + g_data_tim)) + 1;    /* Total touch count up */
            }
        }
        else
        {
             *(g_key_info[method].touch_cnt  + g_data_tim) = (*(g_key_info[method].touch_cnt  + g_data_tim)) + 1;        /* Total touch count up */
        }
    }
    else                                                               /* Outside non-touch */
    {
         *(g_key_info[method].touch_cnt  + g_data_tim) = 0;            /* Inside touch counter clear */

        if (WIDGETS_PRV_OFF == g_touch_function[method].flag.acd1 )    /* Total non-touch function enable flag check */
        {
            freq = 1;
        }
        else
        {
            freq = g_touch_paramter[method].not_touch_freq;
        }

        if (freq == (*(g_key_info[method].non_touch_cnt  + g_data_tim)))        /* Outside non-touch            */
        {
             *(g_key_info[method].out_touch + group) = ((*(g_key_info[method].out_touch + group)) & (~sbit));    /* Outside non-touch */
        }
        else
        {
             *(g_key_info[method].non_touch_cnt  + g_data_tim) = (*(g_key_info[method].non_touch_cnt  + g_data_tim)) + 1;    /* Total non-touch count up */
        }
    }

    /* ===== The reset judgment processing at the time of continuation on ===== */
    if (1 == g_touch_function[method].flag.msa)
    {
        if (0 != g_touch_paramter[method].msa_freq)
        {
            /* If reaching (c_msa(DF_MSA_DATA) + AcdON threshold),
                it makes OnOff judgment result off and it revises a drift. */
            if ((g_touch_paramter[method].msa_freq + freq) == (*(g_key_info[method].touch_cnt  + g_data_tim)))
            {
                /* Real touch and Virtual touch OFF */
                (*(g_key_info[method].out_touch  + group))       &= (~sbit);
                (*(g_key_info[method].in_touch   + group))       &= (~sbit);
                (*(g_key_info[method].touch_cnt  + g_data_tim))   = 0;

                /* parameter reset */
                *(g_key_info[method].drift_cnt     + g_data_tim)   = 0;
                *(g_key_info[method].drift_add_ref + g_data_tim)   = 0x00000000ul;
                *(g_key_info[method].ref           + g_data_tim)   = value;
            }
        }
    }

    /* ===== ONOFF final result ===== */
    if (0 != ((*(g_key_info[method].out_touch  + group)) & sbit))
    {
         (*(g_key_info[method].touch_result + group)) |= sbit;
    }
    else
    {
         (*(g_key_info[method].touch_result + group)) &= (~sbit);
    }
}    /* End of function touch_judgement() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_drift_correction
* Description  : Drift correction function ( Reference value update )
* Arguments    : value    Measurement value
*              : group    Key touch/non-touch data storage buffer ID
*              : offset   Key number offset value
* Return Value : DRIFT_OK(0)
*              : DRIFT_OFF(2)
***********************************************************************************************************************/
static uint8_t touch_drift_correction( uint8_t method, uint16_t value, uint8_t group, uint8_t offset )
{
    uint16_t    sbit;

    /* If the drift processing is a prohibition */
    if (WIDGETS_PRV_OFF == g_touch_function[method].flag.drift)
    {
        /* There is no processing */
        return DRIFT_OFF;
    }

    sbit = ( 0x0001 << offset );

    /* In case of doing drift correction being and moreover On/Off judgment result 1=OFF */
    if ((0x0000ul == ((*(g_key_info[method].in_touch + group)) & sbit)) && (0x0000ul != ((*(g_key_info[method].drift_permission + group)) & sbit)))
    {
        /* It is an addition for the drift correction average calculation */
        *(g_key_info[method].drift_add_ref  + g_data_tim) = (*(g_key_info[method].drift_add_ref + g_data_tim)) + value;

        /* Drift correction counter's being incremented */
        *(g_key_info[method].drift_cnt + g_data_tim) = ((*(g_key_info[method].drift_cnt + g_data_tim)) + 1);

