NamJeongkuk/ref_main/src/micro-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_widgets.c
        if ((*(g_key_info[method].drift_cnt + g_data_tim)) <= g_touch_paramter[method].drift_freq)
        {
            /* If reaching the correction number of times */
            if ((*(g_key_info[method].drift_cnt  + g_data_tim)) == g_touch_paramter[method].drift_freq)
            {
                if (0 == g_touch_paramter[method].drift_freq)
                {
                    g_touch_paramter[method].drift_freq = 1;
                }
                *(g_key_info[method].ref  + g_data_tim)  = ((*(g_key_info[method].drift_add_ref + g_data_tim)) / g_touch_paramter[method].drift_freq);

                /* To REF of the average */
                *(g_key_info[method].drift_add_ref  + g_data_tim) = 0x0000000ul;

                /* Work clear */
                *(g_key_info[method].drift_cnt      + g_data_tim) = 0;
            }
        }
        else
        {
            *(g_key_info[method].drift_add_ref  + g_data_tim) = 0x0000000ul;
            *(g_key_info[method].drift_cnt      + g_data_tim) = 0;
        }
    }
    else
    {
         *(g_key_info[method].drift_add_ref  + g_data_tim) = 0x00000000ul;
         *(g_key_info[method].drift_cnt      + g_data_tim) = 0;
    }
    return DRIFT_OK;
} /* End of function touch_drift_correction() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_key_function_check
* Description  : 
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
uint8_t touch_key_function_check( uint8_t method, uint8_t loop )
{
    uint8_t     key_id;
    uint8_t     offset;
    uint16_t    sbit;

    if (WIDGETS_PRV_KEY_GROUP0 > loop)
    {
        key_id = 0;
        offset = loop;
    }
    else if (WIDGETS_PRV_KEY_GROUP1 > loop)
    {
        key_id = 1;
        offset = (loop - WIDGETS_PRV_KEY_GROUP0);
    }
    else if (WIDGETS_PRV_KEY_GROUP2 > loop)
    {
        key_id = 2;
        offset = (loop - WIDGETS_PRV_KEY_GROUP1);
    }
    else if (WIDGETS_PRV_KEY_GROUP3 > loop)
    {
        key_id = 3;
        offset = (loop - WIDGETS_PRV_KEY_GROUP2);
    }
    else
    {
        return KEY_DISENABLE;
    }

    sbit = (0x0001 << offset);
    if (0x0000 == ((*(g_key_info[method].key_used_info + key_id)) & sbit))
    {
        return KEY_DISENABLE;
    }

    return KEY_ENABLE;
} /* End of function touch_key_function_check() */


#if (QE_MAX_SLIDERS != 0)

#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: slider_decode
* Description  : Slider decode function
* Arguments    : s_id           Slider ID( 0-7 )
* Return Value : slider_rpos    Slider touch position( 65535 = non-touch )
***********************************************************************************************************************/
uint16_t slider_decode( uint8_t s_id )
{
    uint8_t     loop;
    uint8_t     max_num;
    uint8_t     maxch1[3];
    uint16_t    d1;
    uint16_t    d2;
    uint16_t    d3;
    uint16_t    slider_vpos;        /* Slider virtual position        */
    uint16_t    slider_rpos;
    uint8_t     resol_num;
    uint16_t    resol_plus;
    uint16_t    resol_minus;
    uint16_t    dsum;               // replaces g_slider_dsum[s_id]

    /* Unstable Correction */
    for (loop = 0, max_num = 0; loop < (gp_sliderInfo[s_id].num_elements-1); loop++)
    {
        if (g_slider_data[max_num] < g_slider_data[loop+1])
        {
            max_num = loop + 1;
        }
    }

    /*The maximum ch number to change is put in the array. */
    maxch1[0] = max_num;

    /* Array making for slider operation-------------*/
    /*     |    Maximum change CH_No -----> Array"0"    */
    /*     |    Maximum change CH_No + 1 -> Array"2"    */
    /*     |    Maximum change CH_No - 1 -> Array"1"    */
    if (0u < g_slider_data[maxch1[0]])
    {
        if (0u == maxch1[0])
        {
            maxch1[1] = (maxch1[0] + 2);
            maxch1[2] = (maxch1[0] + 1);
        }
        else if ((gp_sliderInfo[s_id].num_elements - 1) == maxch1[0])
        {
            maxch1[1] = (maxch1[0] - 1);
            maxch1[2] = (maxch1[0] - 2);
        }
        else
        {
            maxch1[1] = (maxch1[0] - 1);
            maxch1[2] = (maxch1[0] + 1);
        }

        /* Constant decision for operation of angle of slider */
        /*    Three constant decisions for the operation      */
        /*    Operation of angle of slider                    */
        d1 = g_slider_data[maxch1[0]] - g_slider_data[maxch1[1]];
        d2 = g_slider_data[maxch1[0]] - g_slider_data[maxch1[2]];
        dsum = (d1 + d2);

        if(dsum > gp_sliderInfo[s_id].thr_offset)
        {
            dsum = dsum - gp_sliderInfo[s_id].thr_offset;
        }
        else
        {
            dsum = 0;
        }

        if (dsum > gp_sliderInfo[s_id].threshold)
        {
            if (ZERO_ENA != slider_decode_abnormal_judgement( s_id, d1, d2, maxch1[0] ))
            {
                 d3          = 100 + ((d2 * 100) / d1);
                 slider_vpos = ((10000 / d3) + (100 * maxch1[0]));

                 resol_num   = (gp_sliderInfo[s_id].num_elements - 1);
                 resol_plus  = (100 * resol_num);
                 resol_minus = (50 / gp_sliderInfo[s_id].resolution);

                 /* swa = 0 -> Max ------ swa output 1 to Max */
                 slider_rpos = (uint16_t)(slider_vpos / gp_sliderInfo[s_id].resolution);
                 if (0 == slider_rpos)
                 {
                     slider_rpos = 1;
                 }
                 else if (slider_rpos >= (resol_plus / gp_sliderInfo[s_id].resolution))
                 {
                     slider_rpos = (slider_rpos - (resol_plus / gp_sliderInfo[s_id].resolution)) * 2;
                     slider_rpos = slider_rpos + (resol_plus / gp_sliderInfo[s_id].resolution);
                     if (slider_rpos > ((100 / gp_sliderInfo[s_id].resolution) * gp_sliderInfo[s_id].num_elements))
                     {
                         slider_rpos = ((100 / gp_sliderInfo[s_id].resolution) * gp_sliderInfo[s_id].num_elements);
                     }
                 }
                 else if (slider_rpos <= (100 / gp_sliderInfo[s_id].resolution))
                 {
                     if( slider_rpos < resol_minus )
                     {
                        slider_rpos = 1;
                     }
                     else
                     {
                         slider_rpos = slider_rpos - resol_minus;
                         if(0 == slider_rpos)
                         {
                             slider_rpos = 1;
                         }
                         else
                         {
                             slider_rpos = slider_rpos * 2;
                         }
                     }
                 }
                 else
                 {
                     ;      /* Do Nothing */
                 }

