NamJeongkuk/ref_main/src/micro-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_widgets.c
                 slider_rpos /= gp_sliderInfo[s_id].num_elements;   // Scale results to be 0-100
                 gp_sliderInfo[s_id].value = slider_rpos;
             }
          }
        else
        {
            gp_sliderInfo[s_id].value = 0xFFFFu;
            slider_rpos = 0xFFFFu;
        }
    }
    else
    {
        /* Touch Off Value */
        gp_sliderInfo[s_id].value = 0xFFFFu;
        slider_rpos = 0xFFFFu;
    }
    return slider_rpos;
}    /* End of function slider_decode() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: slider_decode_abnormal_judgement
* Description  : 0 operation removal
* Arguments    : id            slider ID ( 0-7 )
*              : delta1        delta value 1
*              : delta2        delta value 2
*              : maxch         Max measurement value sensor number
* Return Value : status        ZERO_ENA (0)
*              :               ZERO_DIS (1)
***********************************************************************************************************************/
uint8_t slider_decode_abnormal_judgement(uint8_t id, uint16_t delta1, uint16_t delta2, uint8_t maxch)
{
    uint8_t status;

    status = ZERO_DIS;

    if (0x0000 == delta1)
    {
        if (0 == maxch)
        {
            gp_sliderInfo[id].value = 1;
        }
        else
        {
            gp_sliderInfo[id].value = ((100 / gp_sliderInfo[id].resolution) * maxch) / gp_sliderInfo[id].num_elements;
        }
        status = ZERO_ENA;
    }
    else if (0x0000 == delta2)
    {
        gp_sliderInfo[id].value = ((100 / gp_sliderInfo[id].resolution) * (maxch + 1)) / gp_sliderInfo[id].num_elements;
        status = ZERO_ENA;
    }
    else
    {
        ;       // coding standard requirement
    }

    return status;
}    /* End of function slider_decode_abnormal_judgement() */
#endif /* (QE_MAX_SLIDERS != 0) */


#if (QE_MAX_WHEELS != 0)

#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: wheel_decode
* Description  : Wheel Decode function
* Arguments    : w_id          Wheel ID ( 0-7 )
* Return Value : wheel_rpos    Wheel touch position( 65535 = non-touch )
***********************************************************************************************************************/
uint16_t wheel_decode( uint8_t w_id )
{
    uint8_t     loop;
    uint8_t     max_num;
    uint8_t     maxch[3];
    uint16_t    d1;
    uint16_t    d2;
    uint16_t    d3;
    uint16_t    wheel_vpos;        /* Wheel virtual position    */
    uint16_t    wheel_rpos;
    uint16_t    dsum;           // GI: replaces g_wheel_dsum[w_id]

    /* Unstable Correction */
    for (loop = 0, max_num = 0; loop < (gp_wheelInfo[w_id].num_elements-1); loop++)
    {
        if (g_wheel_data[max_num] < g_wheel_data[loop+1])
        {
            max_num = loop + 1;
        }
    }

    /*The maximum ch number to change is put in the array. */
    maxch[0] = max_num;

    /* Array making for slider operation          */
    /*    Maximum change CH_No -----> Array"0"    */
    /*    Maximum change CH_No + 1 -> Array"2"    */
    /*    Maximum change CH_No - 1 -> Array"1"    */
    if (0u < g_wheel_data[maxch[0]])
    {
        if (0u == maxch[0])
        {
            maxch[1] = (gp_wheelInfo[w_id].num_elements - 1);
            maxch[2] = (maxch[0] + 1);
        }
        else if (( gp_wheelInfo[w_id].num_elements - 1 ) == maxch[0])
        {
            maxch[1] = (maxch[0] - 1);
            maxch[2] = 0;
        }
        else
        {
            maxch[1] = (maxch[0] - 1u);
            maxch[2] = (maxch[0] + 1u);
        }

        /* Constant decision for operation of angle of wheel    */
        /*    Three constant decisions for the operation        */
        /*    Operation of angle of wheel                       */
        d1 = g_wheel_data[maxch[0]] - g_wheel_data[maxch[1]];
        d2 = g_wheel_data[maxch[0]] - g_wheel_data[maxch[2]];
        dsum = (d1 + d2);

        if(dsum > gp_wheelInfo[w_id].thr_offset)
        {
            dsum = dsum - gp_wheelInfo[w_id].thr_offset;
        }
        else
        {
            dsum = 0;
        }

        if (dsum > gp_wheelInfo[w_id].threshold)
        {
            if (ZERO_ENA != wheel_decode_abnormal_judgement( w_id, d1, d2, maxch[0] ))
            {
                d3 = 100 + ((d2 * 100) / d1);

                if( 4 == gp_wheelInfo[w_id].num_elements )
                {
                    wheel_vpos = ((9000 / d3) + ( 90 * maxch[0] ));
                }
                else
                {
                    wheel_vpos = ((4500 / d3) + ( 45 * maxch[0] ));
                }

                /* Angle division output */
                /* diff_angle_ch = 0 -> 359 ------ diff_angle_ch output 1 to 360 */
                if (0 == wheel_vpos)
                {
                    wheel_vpos = 360;
                }
                else if (361 == wheel_vpos)
                {
                    wheel_vpos = 1;
                }
                else if (361 < wheel_vpos)
                {
                    wheel_vpos = (wheel_vpos-360) >> 1;
                }
                else
                {
                    ;   /* Do Nothing */
                }

                /* swa = 0 -> Max ------ swa output 1 to Max */
                wheel_rpos = (uint16_t)(wheel_vpos / gp_wheelInfo[w_id].resolution);
                if (0 == wheel_rpos)
                {
                    wheel_rpos = 1;
                }
                gp_wheelInfo[w_id].value = wheel_rpos;
            }
        }
        else
        {
            gp_wheelInfo[w_id].value = 0xFFFFu;
            wheel_rpos = 0xFFFFu;
        }
    }
    else
    {
        /* Touch Off Value */
        gp_wheelInfo[w_id].value = 0xFFFFu;
        wheel_rpos = 0xFFFFu;
    }
    return wheel_rpos;
}    /* End of function wheel_decode() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: wheel_decode_abnormal_judgement
* Description  : 0 operation removal
* Arguments    : id            wheel ID ( 0-7 )
*              : delta1        delta value 1
*              : delta2        delta value 2
*              : maxch         Max measurement value sensor number
* Return Value : status        ZERO_ENA (0)
*              :               ZERO_DIS (1)
***********************************************************************************************************************/
uint8_t wheel_decode_abnormal_judgement(uint8_t id, uint16_t delta1, uint16_t delta2, uint8_t maxch)
{
    uint8_t status;

    status = ZERO_DIS;

    if( 4 == gp_wheelInfo[id].num_elements )
    {
        if (0x0000 == delta1)
        {
            if (0 == maxch)
            {
                gp_wheelInfo[id].value = (360 / gp_wheelInfo[id].resolution);
            }
            else
            {
                gp_wheelInfo[id].value = (90 / gp_wheelInfo[id].resolution) * maxch;
            }
            status = ZERO_ENA;
        }
        else if (0x0000 == delta2)
        {
            gp_wheelInfo[id].value = (90 / gp_wheelInfo[id].resolution) * (maxch + 1);
            status = ZERO_ENA;
        }
        else
        {
            ;       // for coding standard
        }
    }
    else
    {
        if (0x0000 == delta1)
        {
            if (0 == maxch)
            {
                gp_wheelInfo[id].value = (360 / gp_wheelInfo[id].resolution);
            }
            else
            {
                gp_wheelInfo[id].value = (45 / gp_wheelInfo[id].resolution) * maxch;
            }
            status = ZERO_ENA;
        }
        else if (0x0000 == delta2)
        {
            gp_wheelInfo[id].value = (45 / gp_wheelInfo[id].resolution) * (maxch + 1);
            status = ZERO_ENA;
        }
        else
        {
            ;       // for coding standard
        }
    }

    return status;
}    /* End of function wheel_decode_abnormal_judgement() */

#endif /* (QE_MAX_WHEELS != 0) */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE_END
#endif
